In [2]:
import pandas as pd
import numpy as np

In [23]:
df = pd.read_csv('data/Koeppen-Geiger-ASCII/Koeppen-Geiger-ASCII.txt', sep='  ')

/home/matchdt/miniconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [24]:
df.head().T

                 0       1       2       3       4
Lat         -89.75  -89.75  -89.75  -89.75  -89.75
Unnamed: 1 -179.75 -179.25 -178.75 -178.25 -177.75
Unnamed: 2     NaN     NaN     NaN     NaN     NaN
Lon            NaN     NaN     NaN     NaN     NaN
Unnamed: 4      EF      EF      EF      EF      EF
Unnamed: 5    None    None    None    None    None
Cls            NaN     NaN     NaN     NaN     NaN

In [27]:
df['Lon'] = df['Unnamed: 1']

In [29]:
df['Cls'] = df['Unnamed: 4']

In [34]:
df.drop(['Unnamed: 1', 'Unnamed: 2','Unnamed: 4', 'Unnamed: 5'], axis=1, inplace=True)

In [36]:
df.head()

     Lat     Lon  Cls
0 -89.75 -179.75   EF
1 -89.75 -179.25   EF
2 -89.75 -178.75   EF
3 -89.75 -178.25   EF
4 -89.75 -177.75   EF

In [40]:
df.to_csv('data/kg-regions.csv', index=False)

In [41]:
kgreg = pd.read_csv('data/kg-regions.csv')

In [42]:
kgreg.head()

     Lat     Lon  Cls
0 -89.75 -179.75   EF
1 -89.75 -179.25   EF
2 -89.75 -178.75   EF
3 -89.75 -178.25   EF
4 -89.75 -177.75   EF